import UIKit

// Класс Car (Автомобиль)
class Car {
    weak var driver: Man? // Используем weak, чтобы избежать retain cycle
    
    deinit {
        print("Машина удалена из памяти")
    }
}

// Класс Man (Человек)
class Man {
    weak var myCar: Car? // Используем weak, чтобы избежать retain cycle
    
    deinit {
        print("Мужчина удален из памяти")
    }
}

// Объявим переменные как опциональные, чтобы иметь возможность присвоить им nil
var car: Car? = Car()
var man: Man? = Man()

// Устанавливаем ссылки между объектами
car?.driver = man
man?.myCar = car

// Теперь объекты ссылаются друг на друга, но так как ссылки weak,
// они не создают цикл удержания (retain cycle), а просто ссылаются на объекты

// Присваиваем nil переменным, удаляем ссылки
car = nil
man = nil

// Теперь объекты корректно освобождаются из памяти,
// так как ни одна из переменных больше не удерживает объекты сильной ссылкой
